In [1]:
import pandas as pd
import numpy as np

In [2]:
df_titles = pd.read_csv("titles.csv")
df_casts = pd.read_csv("cast.csv")

In [3]:
df_titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
df_casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
df_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

#  1.How many movies are listed in the titles dataframe?

In [6]:
print(df_titles.shape[0], "movies have been listed")

244914 movies have been listed

# 2.What are the earliest two films listed in the titles dataframe?

In [7]:
early_movies = np.array(df_titles.sort_values(by=["year"]).head(2).title)

In [8]:
print("The earliest two movies are:")
for title_number in range(len(early_movies)):
    print(f"{title_number+1}. {early_movies[title_number]}")

The earliest two movies are:
1. Miss Jerry
2. The Startled Lover

# 3.How many movies have the title "Hamlet"?

<p style = "font-size: 19px; margin-bottom: 7px">Only Hamlet<br></p>

In [9]:
ham_title = df_titles.title == "Hamlet"
print(df_titles[ham_title].shape[0],'movies have the title "Hamlet"')

20 movies have the title "Hamlet"

<p style = "font-size: 19px; margin-bottom: 7px">Hamlet in the title<br></p>

In [10]:
ham_in_title = df_titles.title.str.contains("Hamlet") == True
print(df_titles[ham_in_title].shape[0],'movies have "Hamlet" in the title')

57 movies have "Hamlet" in the title

# 4.How many movies are titled "North by Northwest"?

In [11]:
filt = df_titles.title == "North by Northwest"
print(df_titles[filt].shape[0],'movie are titled "North by Northwest"')

1 movie are titled "North by Northwest"

# 5.When was the first movie titled "Hamlet" made?

In [12]:
print('The first movie titled "Hamlet" was made in the year', df_titles[ham_title].year.min())

The first movie titled "Hamlet" was made in the year 1910

# 6.List all of the "Treasure Island" movies from earliest to most recent.

In [13]:
treasure_i = df_titles.title == "Treasure Island"
df_titles[treasure_i].sort_values(by="title")

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

# 7.How many movies were made in the year 1950?

In [147]:
moviesIn_1950 = df_titles.year == 1950
print(df_titles[moviesIn_1950].shape[0], "movies were made in the year 1950")

1113 movies were made in the year 1950

# 8.How many movies were made in the year 1960?

In [148]:
moviesIn_1960 = df_titles.year == 1960
print(df_titles[moviesIn_1960].shape[0], "movies were made in the year 1960")

1549 movies were made in the year 1960

# 9.How many movies were made from 1950 through 1959?

In [149]:
filt = (df_titles["year"] >= 1950) & (df_titles["year"] < 1960)
print(df_titles[filt].shape[0], "movies were made in the year 1960")

12934 movies were made in the year 1960

# 10.In what years has a movie titled "Batman" been released?

In [17]:
bat_title = df_titles.title == "Batman"
years = np.array(df_titles.loc[bat_title, "year"])

In [18]:
print('In the following years "Batman" has been released')
for index in range(len(years)):
    print(f"{index+1}. {years[index]}")

In the following years "Batman" has been released
1. 1943
2. 1989

# 11.How many roles were there in the movie "Inception"?

In [19]:
filt_incep = (df_casts["title"] == "Inception")
print(df_casts[filt_incep].shape[0],'roles were there in the movie "Inception"')

78 roles were there in the movie "Inception"

# 12.How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [150]:
n_null = df_casts[filt_incep]['n'].isnull()
print(df_casts[filt_incep][n_null].shape[0],'roles in the movie "Inception" are NOT ranked by an "n" value')

27 roles in the movie "Inception" are NOT ranked by an "n" value

# 13.But how many roles in the movie "Inception" did receive an "n" value?

In [44]:
n_value = df_casts[filt_incep]['n'].notnull()
print(len(df_casts[filt_incep][n_value]),'roles in the movie "Inception" are NOT ranked by an "n" value')

51 roles in the movie "Inception" are NOT ranked by an "n" value

# 14.Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [60]:
nbn = (df_casts["title"] == "North by Northwest") & df_casts["n"].notnull()
nbn_sorted=df_casts[nbn].sort_values('n')
nbn_sorted[["name", "type", "character"]].set_index(np.arange(1,nbn_sorted["name"].size+1))

                    name     type                    character
1             Cary Grant    actor           Roger O. Thornhill
2        Eva Marie Saint  actress                  Eve Kendall
3            James Mason    actor              Phillip Vandamm
4    Jessie Royce Landis  actress              Clara Thornhill
5         Leo G. Carroll    actor                The Professor
6   Josephine Hutchinson  actress                Mrs. Townsend
7            Philip Ober    actor              Lester Townsend
8          Martin Landau    actor                      Leonard
9          Adam Williams    actor                     Valerian
10          Edward Platt    actor              Victor Larrabee
11     Robert Ellenstein    actor                        Licht
12          Les Tremayne    actor                   Auctioneer
13       Philip Coolidge    actor                    Dr. Cross
14         Patrick McVey    actor               Sergeant Flamm
15          Edward Binns    actor               Captain Junket
16             Ken Lynch    actor  Charley - Chicago Policeman

# 15.Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [62]:
sleuth_1972 = (df_casts.year == 1972) & (df_casts.title == "Sleuth")
sleuCast_sort = df_casts[sleuth_1972].sort_values(by='n')
sleuCast_sort[["name", "type", "character"]].set_index(np.arange(1,sleuCast_sort["name"].size+1))

                 name     type                   character
1    Laurence Olivier    actor                 Andrew Wyke
2       Michael Caine    actor                 Milo Tindle
3      Alec Cawthorne    actor           Inspector Doppler
4  John (II) Matthews    actor  Detective Sergeant Tarrant
5  Eve (III) Channing  actress             Marguerite Wyke
6        Teddy Martin    actor      Police Constable Higgs

# 16.Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

Assuming we have to ignore null value|

In [66]:
sleuth_2007 = (df_casts.year == 2007) & (df_casts.title == "Sleuth") & df_casts.n.notnull()
sleuCast_sort = df_casts[sleuth_2007].sort_values(by='n')
sleuCast_sort[["name", "type", "character"]].set_index(np.arange(1,sleuCast_sort["name"].size+1))

            name   type    character
1  Michael Caine  actor       Andrew
2       Jude Law  actor         Milo
3  Harold Pinter  actor  Man on T.V.

# 17.How many roles were credited in the silent 1921 version of Hamlet?

In [70]:
answer = len(df_casts[(df_casts["title"] == "Hamlet")&(df_casts.year==1921)])
print(answer,"roles were credited in the silent 1921 version of Hamlet")

9 roles were credited in the silent 1921 version of Hamlet

# 18.How many roles were credited in Branagh’s 1996 Hamlet?

In [92]:
answer = len(df_casts[(df_casts["title"] == "Hamlet")& (df_casts["year"]==1996)])
print(answer,"roles were credited in Branagh’s 1996 Hamlet")

54 roles were credited in Branagh’s 1996 Hamlet

# 19.How many "Hamlet" roles have been listed in all film credits through history?

In [95]:
hamlet = df_casts["title"] == "Hamlet"
print(len(df_casts[hamlet]),'"Hamlet" roles have been listed in all film credits through history')

342 "Hamlet" roles have been listed in all film credits through history

# 20.How many people have played an "Ophelia"?

In [99]:
answer = len(df_casts[df_casts["character"]=="Ophelia"])
print(answer, 'How many people have played an "Ophelia"')

117 How many people have played an "Ophelia"

# 21.How many people have played a role called "The Dude"?

In [100]:
answer = len(df_casts[df_casts["character"]=="The Dude"])
print(answer, 'How many people have played an "The Dude"')

19 How many people have played an "The Dude"

# 22.How many people have played a role called "The Stranger"?

In [101]:
answer = len(df_casts[df_casts["character"]=="The Stranger"])
print(answer, 'How many people have played an "The Stranger"')

212 How many people have played an "The Stranger"

# 23.How many roles has Sidney Poitier played throughout his career?

In [105]:
answer = len(df_casts[df_casts["name"]=="Sidney Poitier"])
print(f'Sidney Poitier has played {answer} roles throughout his career')

Sidney Poitier has played 43 roles throughout his career

# 24.How many roles has Judi Dench played?

In [108]:
answer = len(df_casts[df_casts["name"]=="Judi Dench"])
print(f'Judi Dench has played {answer} roles throughout his career')

Judi Dench has played 55 roles throughout his career

# 25.List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [119]:
supp_car = (df_casts.name == "Cary Grant") & (df_casts.n == 2)
cary_supp = df_casts[supp_car].sort_values(by="year")
cary_supp.drop(columns = ["name", "type", 'n']).set_index(np.arange(1,len(cary_supp)+1))

                     title  year                  character
1         Madame Butterfly  1932  Lieutenant B.F. Pinkerton
2       She Done Him Wrong  1933           Captain Cummings
3        The Woman Accused  1933             Jeffrey Baxter
4   The Eagle and the Hawk  1933              Henry Crocker
5             I'm No Angel  1933               Jack Clayton
6      Thirty Day Princess  1934         Porter Madison III
7           Born to Be Bad  1934             Malcolm Trevor
8          Sylvia Scarlett  1935              Jimmy Monkley
9            Enter Madame!  1935          Gerald Fitzgerald
10       Wings in the Dark  1935                 Ken Gordon
11         Wedding Present  1936              Charlie Mason
12     When You're in Love  1937               Jimmy Hudson
13         The Awful Truth  1937             Jerry Warriner
14   The Toast of New York  1937                  Nick Boyd
15                  Topper  1937               George Kerby
16                 Holiday  1938                Johnny Case
17        Bringing Up Baby  1938                      David
18            In Name Only  1939                Alec Walker
19        My Favorite Wife  1940                 Nick Arden
20          Penny Serenade  1941                Roger Adams

# 26.List the leading roles that Cary Grant played in the 1940s in order by year.

In [123]:
lead_car = (df_casts.name == "Cary Grant") & (df_casts.n == 1) & (df_casts.year >= 1940) & (df_casts.year < 1950)
cary_lead = df_casts[lead_car].sort_values(by="year")
cary_lead.drop(columns = ["name", "type", 'n']).set_index(np.arange(1,len(cary_lead)+1))

,title,year,character
1,The Howards of Virginia,1940,Matt Howard
2,His Girl Friday,1940,Walter Burns
3,The Philadelphia Story,1940,C. K. Dexter Haven
4,Suspicion,1941,Johnnie Aysgarth
5,The Talk of the Town,1942,Leopold Dilg
6,Once Upon a Honeymoon,1942,Patrick 'Pat' O'Toole
7,Destination Tokyo,1943,Capt. Cassidy
8,Mr. Lucky,1943,Joe Adams -posing as Joe Bascopolous
9,Once Upon a Time,1944,Jerry Flynn
10,Arsenic and Old Lace,1944,Mortimer Brewster
11,None But the Lonely Heart,1944,Ernie Mott
12,Night and Day,1946,Cole Porter
13,Notorious,1946,Devlin
14,The Bachelor and the Bobby-Soxer,1947,Dick Nugent
15,The Bishop's Wife,1947,Dudley
16,Mr. Blandings Builds His Dream House,1948,Jim Blandings
17,Every Girl Should Be Married,1948,Dr. Madison Brown
18,I Was a Male War Bride,1949,Captain Henri Rochard

# 27.How many roles were available for actors in the 1950s?

In [126]:
actors_1950s = (df_casts.type == "actor")&(df_casts.year >= 1950) & (df_casts.year < 1960)
print(len(df_casts[actors_1950s]),"roles were available for actors in the 1950s")

157738 roles were available for actors in the 1950s

# 28.How many roles were available for actresses in the 1950s?

In [130]:
actors_1950s = (df_casts.type == "actress")&(df_casts.year >= 1950) & (df_casts.year < 1960)
print(len(df_casts[actors_1950s]),"roles were available for actors in the 1950s")

57733 roles were available for actors in the 1950s

# 29.How many leading roles (n=1) were available from the beginning of film history through 1980?

In [142]:
filt = (df_casts.year <= 1980) & (df_casts.n == 1)
print(len(df_casts[filt]), "leading roles were available from the beginning of film history through 1980?")

65140 leading roles were available from the beginning of film history through 1980?

# 30.How many non-leading roles were available through from the beginning of film history through 1980?

In [144]:
filt = (df_casts.year <= 1980) & (df_casts.n != 1)
print(len(df_casts[filt]), "non-leading roles were available through from the beginning of film history through 1980")

1117667 non-leading roles were available through from the beginning of film history through 1980

# 31.How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [146]:
filt = (df_casts.year == 1980) & (df_casts.n.isnull())
print(len(df_casts[filt]), "roles through 1980 were minor enough that they did not warrant a numeric 'n' rank")

4466 roles through 1980 were minor enough that they did not warrant a numeric 'n' rank